Конфигурация/Documents/ПриходТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничнаяТекущая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничнаяНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/ПриходТовара/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// =========================================================================
// ПОДКЛЮЧЕНИЕ ОБОРУДОВАНИЯ (БПО)
// =========================================================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ПодключаемоеОборудование: разрешить использование сканера
	ИспользоватьПодключаемоеОборудование = Истина;
	
	ТипыОборудования = МенеджерОборудования.ПараметрыТипыОборудования();
	ТипыОборудования.СканерШтрихкода = Истина;
	МенеджерОборудования.ПриСозданииНаСервере(ЭтаФорма, ТипыОборудования);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование: подключение сканера штрихкодов при открытии формы
	Результаты = Ждать МенеджерОборудованияКлиент.ПодключитьОборудованиеПриОткрытииФормыАсинх(ЭтаФорма);
	Для Каждого Результат Из Результаты Цикл
		Если Не Результат.Результат Тогда
			Сообщить(Результат.ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование: отключение оборудования при закрытии формы
	Ждать МенеджерОборудованияКлиент.ОтключитьОборудованиеПриЗакрытииФормыАсинх(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// =========================================================================
// АППАРАТНЫЙ СКАНЕР ШТРИХКОДОВ
// =========================================================================

// Обработка оповещений от МенеджераОборудования.
// При сканировании аппаратным сканером автоматически:
// - Ищет ПриходТовара документ, содержащий товар с данным штрихкодом
// - Если найден, открывает карточку документа
//
// Параметры:
//  ИмяСобытия - Строка - имя события оповещения
//  Параметр - Произвольный - данные оповещения
//  Источник - Произвольный - источник оповещения
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// БПО: события от подключаемого оборудования (сканер штрихкодов)
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			// Новый формат БПО - структура с полем Штрихкод
			Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Штрихкод") Тогда
				ОбработатьШтрихкодСканера(Параметр.Штрихкод);
			// Старый формат БПО - массив
			ИначеЕсли ТипЗнч(Параметр) = Тип("Массив") И Параметр.Количество() > 0 Тогда
				ОбработатьШтрихкодСканера(Параметр[0]);
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработка штрихкода от аппаратного сканера.
// Ищет документ ПриходТовара, содержащий товар с данным штрихкодом.
// Если найден, открывает карточку документа.
//
// Параметры:
//  Штрихкод - Строка - считанный штрихкод
//
&НаКлиенте
Процедура ОбработатьШтрихкодСканера(Штрихкод)
	
	Если ПустаяСтрока(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск документа по штрихкоду товара
	НайденныйДокумент = НайтиДокументПоШтрихкоду(Штрихкод);
	
	Если НайденныйДокумент = Неопределено Тогда
		ПоказатьОповещениеПользователя(
			"Документ не найден",
			,
			"Товар со штрихкодом """ + Штрихкод + """ не найден ни в одном документе прихода",
			БиблиотекаКартинок.Ошибка32);
		Возврат;
	КонецЕсли;
	
	// Открываем карточку найденного документа
	ПоказатьЗначение(Неопределено, НайденныйДокумент);
	
КонецПроцедуры

// Поиск документа ПриходТовара по штрихкоду товара.
// Возвращает ссылку на последний документ, содержащий данный товар.
//
// Параметры:
//  Штрихкод - Строка - искомый штрихкод товара
//
// Возвращаемое значение:
//  ДокументСсылка.ПриходТовара, Неопределено - ссылка на документ или Неопределено
//
&НаСервереБезКонтекста
Функция НайтиДокументПоШтрихкоду(Знач Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриходТовара.Ссылка КАК Документ
	|ИЗ
	|	Документ.ПриходТовара КАК ПриходТовара
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходТовара.Товары КАК ПриходТовараТовары
	|		ПО ПриходТовара.Ссылка = ПриходТовараТовары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО ПриходТовараТовары.Номенклатура = Штрихкоды.Номенклатура
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|	И НЕ ПриходТовара.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	ПриходТовара.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Документ;
	
КонецФункции

#КонецОбласти
